#created by licw
# -*-coding=utf-8-*-
cs_main_begin_date = '2011-05-06'
zy_type = ['zy1', 'zy2', 'zy3', 'zy4']
cs_url = 'http://www.csindex.com.cn/zh-CN/downloads/industry-price-earnings-ratio?type=%s&date=%s'
file_names = ['sh_a', 'sz_a', 'hs_a', 'sz_m', 'zx', 'cy']
d_type = ['jt_pe', 'dt_pe', 'pb', 'gx']

zz_type = ['zz1', 'zz2', 'zz3', 'zz4']
hy_code = [101, 102,103,
           10101, 10102, 10103, 10104,10105,10106,10107,10108,
           20101,20102,20103,20104,20105,20106,20107,
           20201,20301,20302,20303,20304,20305,
           30101,30102,30201,30202,30203,30204,30301,30302,
           30401,30501,30502,30503,30504,
           40101,40201,40202,40203,40204,40301,40302,
           50101,50102,50103,50201,50202,50203,
           60101,60102,60201,60202,60203,60301,60401,60402,
           70101,70102,70103,70201,70202,70203,70301,
           80101,80102,80201,
           90101,90102,90103,90104,90105 ]
csrc_code = ['00','01','02','03','04','05','06','07','08','09']
gs_url = 'http://www.csindex.com.cn/zh-CN/downloads/industry-price-earnings-ratio-detail?industry_code=1&zb_flg=1&csrc_code=%s&date=%s&type=0&class=2'
glsj = '002275' ##桂林三金
lfx  = '600612' ##老凤祥
htxx = '600271' ##航天信息
tcyl = '600763' ##通策医疗
sdht = '000915' ##山大华特
xlt  = '002294' ##信立泰
ewsa = '000501' ##鄂武商a
wwsw = '300357' ##我武生物
swgf = '600201' ##生物股份
ynby = '000538' ##云南白药
hcjs = '300124' ##汇川技术
ehyy = '002262' ##恩华药业
sfy  = '002572' ##索菲亚

fhcm = '601928' ##凤凰传媒
hscy = '600305' ##恒顺醋业
flzc = '002507' ##涪陵榨菜
sdgs = '600350' ##山东高速
smgf = '600823' ##世茂股份
xdtz = '000900' ##现代投资
zgtj = '601186' ##中国铁建
caqc = '000625' ##长安汽车
trzb = '002150' ##通润装备
sxxc = '002585' ##双星新材
bldf = '601339' ##百隆东方
qpl  = '002029' ##七匹狼
cjcm = '600757' ##长江传媒
lta  = '000726' ##鲁泰a
dzjt = '600611' ##大众交通
cjdl = '600900' ##长江电力
zsyh = '600036' ##招商银行
zgpa = '601318' ##中国平安
dfyh = '002271' ##东方雨虹
ljz =  '600663' ##陆家嘴
gzmt = '600519' ##贵州茅台
hkws = '002415' ##海康威视
wka = '000002'  ##万科
hryy = '600276' ##恒瑞医药
hold_stocks = [ tcyl, sdht, xlt, ewsa, wwsw, swgf, hcjs, ehyy, sfy,
                cjdl, zsyh, zgpa, gzmt, hkws, wka, hryy]
